α = FiniteTruth("α")
β = FiniteTruth("β")
γ = FiniteTruth("γ")
δ = FiniteTruth("δ")
ε = FiniteTruth("ε")
ζ = FiniteTruth("ζ")
η = FiniteTruth("η")

d9 = Vector{FiniteTruth}([⊥, α, β, γ, δ, ε, ζ, η, ⊤])

jointable = Dict{Tuple{FiniteTruth, FiniteTruth}, FiniteTruth}(
    (⊥, ⊥) => ⊥, (⊥, α) => α, (⊥, β) => β, (⊥, γ) => γ, (⊥, δ) => δ, (⊥, ε) => ε, (⊥, ζ) => ζ, (⊥, η) => η, (⊥, ⊤) => ⊤,
    (α, ⊥) => α, (α, α) => α, (α, β) => δ, (α, γ) => γ, (α, δ) => δ, (α, ε) => η, (α, ζ) => ζ, (α, η) => η, (α, ⊤) => ⊤,
    (β, ⊥) => β, (β, α) => δ, (β, β) => β, (β, γ) => ζ, (β, δ) => δ, (β, ε) => ε, (β, ζ) => ζ, (β, η) => η, (β, ⊤) => ⊤,
    (γ, ⊥) => γ, (γ, α) => γ, (γ, β) => ζ, (γ, γ) => γ, (γ, δ) => ζ, (γ, ε) => ⊤, (γ, ζ) => ζ, (γ, η) => ⊤, (γ, ⊤) => ⊤,
    (δ, ⊥) => δ, (δ, α) => δ, (δ, β) => δ, (δ, γ) => ζ, (δ, δ) => δ, (δ, ε) => η, (δ, ζ) => ζ, (δ, η) => η, (δ, ⊤) => ⊤,
    (ε, ⊥) => ε, (ε, α) => η, (ε, β) => ε, (ε, γ) => ⊤, (ε, δ) => η, (ε, ε) => ε, (ε, ζ) => ⊤, (ε, η) => η, (ε, ⊤) => ⊤,
    (ζ, ⊥) => ζ, (ζ, α) => ζ, (ζ, β) => ζ, (ζ, γ) => ζ, (ζ, δ) => ζ, (ζ, ε) => ⊤, (ζ, ζ) => ζ, (ζ, η) => ⊤, (ζ, ⊤) => ⊤,
    (η, ⊥) => η, (η, α) => η, (η, β) => η, (η, γ) => ⊤, (η, δ) => η, (η, ε) => η, (η, ζ) => ⊤, (η, η) => η, (η, ⊤) => ⊤,
    (⊤, ⊥) => ⊤, (⊤, α) => ⊤, (⊤, β) => ⊤, (⊤, γ) => ⊤, (⊤, δ) => ⊤, (⊤, ε) => ⊤, (⊤, ζ) => ⊤, (⊤, η) => ⊤, (⊤, ⊤) => ⊤
)

meettable = Dict{Tuple{FiniteTruth, FiniteTruth}, FiniteTruth}(
    (⊥, ⊥) => ⊥, (⊥, α) => ⊥, (⊥, β) => ⊥, (⊥, γ) => ⊥, (⊥, δ) => ⊥, (⊥, ε) => ⊥, (⊥, ζ) => ⊥, (⊥, η) => ⊥, (⊥, ⊤) => ⊥,
    (α, ⊥) => ⊥, (α, α) => α, (α, β) => ⊥, (α, γ) => α, (α, δ) => α, (α, ε) => ⊥, (α, ζ) => α, (α, η) => α, (α, ⊤) => α,
    (β, ⊥) => ⊥, (β, α) => ⊥, (β, β) => β, (β, γ) => ⊥, (β, δ) => β, (β, ε) => β, (β, ζ) => β, (β, η) => β, (β, ⊤) => β,
    (γ, ⊥) => ⊥, (γ, α) => α, (γ, β) => ⊥, (γ, γ) => γ, (γ, δ) => α, (γ, ε) => ⊥, (γ, ζ) => γ, (γ, η) => α, (γ, ⊤) => γ,
    (δ, ⊥) => ⊥, (δ, α) => α, (δ, β) => β, (δ, γ) => α, (δ, δ) => δ, (δ, ε) => β, (δ, ζ) => δ, (δ, η) => δ, (δ, ⊤) => δ,
    (ε, ⊥) => ⊥, (ε, α) => ⊥, (ε, β) => β, (ε, γ) => ⊥, (ε, δ) => β, (ε, ε) => ε, (ε, ζ) => β, (ε, η) => ε, (ε, ⊤) => ε,
    (ζ, ⊥) => ⊥, (ζ, α) => α, (ζ, β) => β, (ζ, γ) => γ, (ζ, δ) => δ, (ζ, ε) => β, (ζ, ζ) => ζ, (ζ, η) => δ, (ζ, ⊤) => ζ,
    (η, ⊥) => ⊥, (η, α) => α, (η, β) => β, (η, γ) => α, (η, δ) => δ, (η, ε) => ε, (η, ζ) => δ, (η, η) => η, (η, ⊤) => η,
    (⊤, ⊥) => ⊥, (⊤, α) => α, (⊤, β) => β, (⊤, γ) => γ, (⊤, δ) => δ, (⊤, ε) => ε, (⊤, ζ) => ζ, (⊤, η) => η, (⊤, ⊤) => ⊤
)

join = BinaryOperation(d9, jointable)

meet = BinaryOperation(d9, meettable)

monoid = CommutativeMonoid(meet, ⊤)

H9 = FiniteFLewAlgebra(join, meet, monoid, ⊥, ⊤)
